// поиск всех файлов в заданном каталоге, включая файлы, расположенные в подкаталогах произвольной вложенности.
// Для хождения по директориям используйте стандартную функцию. Результат выдавайте списком, List например.

// Для последних заданий подойдёт стандартный шаблон: делаете две функции, одна основная нерекурсивная, которая получает исходные параметры, и вторая рекурсивная, которая вызывается из первой функции со своими начальными параметрами. Это поможет вам избежать лишних параметров или глобальных переменных.

// Повышенная сложность (можете погуглить).
// Генерация всех корректных сбалансированных комбинаций круглых скобок (параметр -- количество открывающих скобок).
// Например,

// 1 = "()" 
// 2 = "(())" "()()"
// Внешне и внутренне несбалансированные комбинации считаются ошибочными:
// "()))" ")(()" "(()" -- неверно

using System;
using System.Collections.Generic;

namespace Recursion
{
    public class Task8
    {

    }
}